Revised entire site design
