--- a/_posts/2023-06-21-networking-udp-vs-tcp.md
+++ b/_posts/2023-06-21-networking-udp-vs-tcp.md
@@ -19,24 +23,29 @@ Once the connection is established, data can be exchanged bidirectionally betwee
 
 The reliability and error-checking mechanisms of TCP come at a cost: increased overhead and latency. The extensive handshaking and error recovery processes add extra data to each packet and introduce additional round-trip time. This makes TCP ideal for applications that prioritize data integrity and reliability, such as file transfer, web browsing, and email.
 
-```plantuml!
-@startuml
-
-participant "Client" as client
-participant "Server" as server
-
-client -> server: SYN
-server -> client: SYN, ACK
-client -> server: ACK
-...
-client <-> server: Data Exchange
-...
-client -> server: FIN, ACK
-server -> client: ACK
-server -> client: FIN
-client -> server: ACK
-
-@enduml
+```
+   +--------+         +--------+
+   | Client |         | Server |
+   +--------+         +--------+
+       |                   |
+       | SYN               |
+       |------------------>|
+       |          SYN, ACK |
+       |<------------------|
+       | ACK               |
+       |------------------>|
+       |                   |
+       |   Data Exchange   |
+       |<----------------->|
+       |                   |
+       | FIN, ACK          |
+       |------------------>|
+       |               ACK |
+       |<------------------|
+       | FIN               |
+       |------------------>|
+       |               ACK |
+       |<------------------|
 ```
 
 ## UDP: Speed and Simplicity
